@SerhiiPodlesnyi @ElkRom can you confirm that with `minikube` it works for you ?

I understand you are using AKS version 1.23.12

Can you provide the details of a minimal `az aks create` command to create a cluster where the problem can be reproduced ?

I tried the following:

```
az group create --location eastus --name debug

az aks create \
--location eastus \
--name issue41792 \
--resource-group debug \
--network-plugin azure \
--kubernetes-version 1.23.12 \
--node-vm-size Standard_DS2_v2 \
--node-count 2

az aks get-credentials --resource-group debug --name issue41792
```
Then with the same `istio.tf` as comment https://github.com/istio/istio/issues/41792#issuecomment-1303930124
```
terraform init -upgrade
terraform plan
```

It is working for me and it is generating this plan:

```
% terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.istio-base will be created
  + resource "helm_release" "istio-base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-base"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.15.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istiod will be created
  + resource "helm_release" "istiod" {
      + atomic                     = true
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = true
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istiod"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.15.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

Please provide the `az aks create` command to create the AKS cluster with environment where you can reproduce this problem. Thanks

